{
  "backend/main.mo": "Motoko canister managing services and appointment bookings with validation, storage, and query methods.",
  "feature_evidence.json": "Feature evidence report mapping UI color-update and logo-integration features to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and structure of all major frontend files and components.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH theme tokens for light/dark modes and shared UI variables.",
  "frontend/index.html": "Main HTML entry with metadata, fonts, favicon, and OG images for the Baidees Salon site.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router routes and wrapping the UI in ThemeProvider with Toaster.",
  "frontend/src/components/booking/BookingForm.tsx": "Booking form component handling input validation, service selection, and backend submission with success state.",
  "frontend/src/components/branding/BrandLogo.tsx": "Reusable logo component choosing horizontal or square logo variants with size-based classes.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying logo, quick links, contact info, social icons, and dynamic attribution.",
  "frontend/src/components/layout/Navbar.tsx": "Responsive navbar with navigation links, CTAs, and mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including navbar, routed content outlet, and footer.",
  "frontend/src/components/marketing/MembershipCardSection.tsx": "Animated section showcasing membership benefits with icons and a call-to-action button.",
  "frontend/src/components/marketing/OfferBanner.tsx": "Gold banner displaying a limited‑time promotional offer.",
  "frontend/src/components/media/BeforeAfterSlider.tsx": "Image slider cycling through before‑and‑after transformations with navigation controls.",
  "frontend/src/components/media/GalleryGrid.tsx": "Grid layout presenting a set of gallery images with hover zoom effects.",
  "frontend/src/components/sections/FaqAccordion.tsx": "Accordion listing common FAQs with expandable answers.",
  "frontend/src/components/sections/ServiceHighlightsSection.tsx": "Scroll‑revealed section highlighting key salon services with icons and link to full services page.",
  "frontend/src/components/sections/StylistsSection.tsx": "Showcases stylist profiles with photos, titles, and bios.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Displays client testimonials with ratings and quotes in a grid layout.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useBookAppointment.ts": "React Query mutation hook that calls an actor method to book an appointment and handles UI feedback and cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, identity loading, and status tracking using Dfinity AuthClient.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Hook using IntersectionObserver to reveal elements when they enter the viewport.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, base styles, and utility classes for animations and color accents.",
  "frontend/src/main.tsx": "Application entry that mounts React, sets up React Query, and wraps the app in the InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the salon's story and team sections with scroll‑reveal animations and styled content cards.",
  "frontend/src/pages/ContactBookingPage.tsx": "Displays a booking form, contact details, opening hours, and WhatsApp booking with scroll‑reveal effects.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery grid and before/after slider with animated section reveals.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero, intro, service highlights, and before/after sections using scroll animations and CTA buttons.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with categorized salon services, scroll-based reveal animation, and UI components like cards and accordions.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for the salon's design system.",
  "project_state.json": "Stores the project’s current state including design guidelines, required images, implemented features, and architectural notes."
}