{
  "backend/main.mo": "Implements a booking system with services, appointment creation, validation, and retrieval using a map store.",
  "feature_evidence.json": "Lists feature definitions, associated files, components, and test IDs for the salon web app.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend files including pages, components, hooks, and styles.",
  "frontend/index.css": "Defines global Tailwind-based design tokens, dark mode variables, and base styling for the site.",
  "frontend/index.html": "HTML entry template loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all pages and wraps the app with a theme provider and toaster.",
  "frontend/src/components/booking/BookingForm.tsx": "Booking form component handling user input, validation, service selection, and backend appointment creation.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with brand details, quick links, contact info, social icons, and attribution.",
  "frontend/src/components/layout/Navbar.tsx": "Responsive navbar with desktop and mobile menus, navigation links, and call/booking CTAs.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page wrapper that renders Navbar, routed content via Outlet, and Footer.",
  "frontend/src/components/marketing/MembershipCardSection.tsx": "Animated section showcasing membership benefits with icons and a CTA link.",
  "frontend/src/components/marketing/OfferBanner.tsx": "Simple promotional banner displaying a limited-time offer.",
  "frontend/src/components/media/BeforeAfterSlider.tsx": "Image slider for before/after transformations with navigation buttons and indicators.",
  "frontend/src/components/media/GalleryGrid.tsx": "Responsive grid displaying gallery images with hover zoom effect.",
  "frontend/src/components/sections/FaqAccordion.tsx": "Accordion list of frequently asked questions and answers.",
  "frontend/src/components/sections/ServiceHighlightsSection.tsx": "Scroll-animated grid highlighting major salon services with icons and link to services page.",
  "frontend/src/components/sections/StylistsSection.tsx": "Section featuring stylist profiles with photos, titles, and bios.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Animated testimonials section showing client reviews with star ratings.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, updating queries when identity changes.",
  "frontend/src/hooks/useBookAppointment.ts": "Defines a React Query mutation hook to book appointments via an actor and refresh appointment data with success and error toasts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider using Dfinity AuthClient to manage identity loading, login, logout, and status.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Provides an intersection‑observer‑based hook that reveals elements when scrolled into view.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, dark mode values, typography, and utility classes for animations and gold accents.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider, then renders App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the salon’s About page with animated sections, story content, stylist section, and feature highlights.",
  "frontend/src/pages/ContactBookingPage.tsx": "Displays a booking form and salon contact details with animated scroll effects and WhatsApp booking support.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery page with animated header, image grid, and before/after slider.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with hero content, offers, sections for highlights and testimonials, and scroll‑revealed animations.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the services page with animated headers and categorized service cards using Tailwind and custom components.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project configuration, design requirements, features, and image needs for the Baidees Salon website build."
}