{
  "backend/main.mo": "Motoko actor managing services and appointments with booking, validation, lookup, and query functions.",
  "feature_evidence.json": "Feature evidence report listing phone-number and address-update tasks with affected files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend components and pages.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes using OKLCH color values.",
  "frontend/index.html": "HTML entry file setting up metadata, fonts, icons, and loading the main React bundle.",
  "frontend/src/App.tsx": "React app root configuring TanStack Router routes and wrapping everything in ThemeProvider with Toaster.",
  "frontend/src/components/booking/BookingForm.tsx": "Appointment booking form with validation, service selection, backend submission, and success state UI.",
  "frontend/src/components/branding/BrandLogo.tsx": "Brand logo component rendering horizontal or square variants with size options.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing brand, navigation links, contact info, and social icons using centralized contact config.",
  "frontend/src/components/layout/Navbar.tsx": "Responsive navbar with links, call-to-action buttons, and mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the site with a navbar, footer, and routed content area.",
  "frontend/src/components/marketing/MembershipCardSection.tsx": "Animated membership section highlighting benefits and linking to contact.",
  "frontend/src/components/marketing/OfferBanner.tsx": "Displays a promotional banner with a limited-time offer message.",
  "frontend/src/components/media/BeforeAfterSlider.tsx": "Image slider showing before-and-after transformations with navigation controls.",
  "frontend/src/components/media/GalleryGrid.tsx": "Grid layout displaying a set of salon-related gallery images.",
  "frontend/src/components/sections/FaqAccordion.tsx": "Accordion component listing frequently asked questions and answers.",
  "frontend/src/components/sections/ServiceHighlightsSection.tsx": "Animated section showcasing key salon services with icons and a link to full services.",
  "frontend/src/components/sections/StylistsSection.tsx": "Presents stylist profiles with photos, titles, and short bios.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Displays client testimonials with ratings in a responsive grid.",
  "frontend/src/config/contact.ts": "Centralized configuration for phone, WhatsApp, email, and business hours.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useBookAppointment.ts": "Provides a mutation to book appointments through the actor and refreshes appointment data on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider with authentication state, login, and identity loading.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Tracks when an element becomes visible via IntersectionObserver and exposes a ref and visibility state.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, and utility classes for animations and gold-themed styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the salon's About page with animated sections, story content, stylists, and feature highlights.",
  "frontend/src/pages/ContactBookingPage.tsx": "Displays the booking page with a form, WhatsApp link, opening hours, and contact details.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery of salon work with animated sections, a grid display, and before/after slider.",
  "frontend/src/pages/HomePage.tsx": "Home page component featuring hero banner, intro text, service highlights, before/after slider, testimonials, and CTAs with scroll reveal animations.",
  "frontend/src/pages/ServicesPage.tsx": "Services listing page showing categorized salon services with pricing, durations, benefits, and animated section reveals.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the salon website’s design goals, features, architecture notes, and current state tracking."
}