{
  "kind": "build_request",
  "title": "Switch accent theme from orange to yellow and apply provided logo site-wide",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Update the global accent color theme from the current orangish/gold accent to a cleaner, brighter yellow accent across the entire UI while keeping the premium black/white base styling. This must apply consistently to existing accent usage (e.g., `text-gold`, `bg-gold`, `border-gold`, focus rings, hover states, glows, badges/banners, CTAs) on all pages and shared components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Change the orangish theme to yellow"
        ]
      },
      "acceptanceCriteria": [
        "All existing UI elements that currently use the gold/orange accent now render with a distinctly yellow accent (not orange) across Home, Services, Gallery, About, Contact/Booking, Navbar, Footer, Offer banner, buttons, links, and focus styles.",
        "No regression in contrast/readability: yellow accent remains legible on dark backgrounds; primary text remains white/foreground as before.",
        "Implementation is centralized via existing design tokens (CSS variables/Tailwind theme) so the change does not require per-component hardcoded color updates except where unavoidable."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Add the user-provided Baidees Salon logo as a static asset and use it wherever possible across the site: at minimum in the Navbar brand area and Footer brand area, and also set it as the site favicon (and an OG/social preview image if present/used). Ensure sizing works on mobile and desktop and preserves the luxury styling (clean spacing, no pixelation).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "also use this logo wherever possible"
        ]
      },
      "acceptanceCriteria": [
        "Navbar brand area displays the provided logo (with appropriate sizing) and links to the Home route.",
        "Footer brand area includes the provided logo (with appropriate sizing) without breaking the existing layout.",
        "`frontend/index.html` includes favicon link(s) pointing to the new logo-derived favicon asset(s).",
        "Logo assets are loaded from frontend static assets (not from the backend) and render sharply on common device pixel ratios."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep backend unchanged; this request is UI/theme/asset-only.",
    "Use the provided uploaded logo as the source of truth; do not invent a different logo mark or text treatment."
  ],
  "nonGoals": [
    "Changing copywriting/content on pages beyond what is necessary to place the logo.",
    "Adding new pages or new booking/business features.",
    "Reworking the site layout or navigation structure beyond integrating the logo into existing header/footer."
  ],
  "imageRequirements": {
    "required": [
      "Square transparent-background logo export (baidees-logo.dim_1024x1024.png)",
      "Horizontal transparent-background logo export (baidees-logo-horizontal.dim_1600x600.png)",
      "Favicon 32x32 (favicon.dim_32x32.png)",
      "Favicon 180x180 (apple-touch-icon.dim_180x180.png)",
      "Open Graph preview image (og-image.dim_1200x630.png)"
    ],
    "edits": [
      "Crop/clean and export logo variants (images.png > baidees-logo.dim_1024x1024.png)",
      "Crop/clean and export horizontal logo variant (images.png > baidees-logo-horizontal.dim_1600x600.png)",
      "Generate favicon from the logo (images.png > favicon.dim_32x32.png)",
      "Generate Apple touch icon from the logo (images.png > apple-touch-icon.dim_180x180.png)",
      "Generate OG image from the logo (images.png > og-image.dim_1200x630.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}