{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Yellow accent theme + site-wide Baidees logo integration",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Centralize and switch the global accent from orange/gold to a cleaner bright yellow across tokens, utilities, and Tailwind theme usage.",
      "acceptanceCriteria": [
        "All existing UI elements that currently use the gold/orange accent now render with a distinctly yellow accent (not orange) across Home, Services, Gallery, About, Contact/Booking, Navbar, Footer, Offer banner, buttons, links, and focus styles.",
        "No regression in contrast/readability: yellow accent remains legible on dark backgrounds; primary text remains white/foreground as before.",
        "Implementation is centralized via existing design tokens (CSS variables/Tailwind theme) so the change does not require per-component hardcoded color updates except where unavoidable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the global design tokens for accent usage by changing the underlying --gold and --ring OKLCH values to a brighter yellow hue and ensuring utility classes (text-gold/bg-gold/border-gold) continue to map to the centralized token (no per-component hardcoding)."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Adjust Tailwind theme extensions so accent styling remains consistent with the new yellow token (e.g., update any gold-themed shadows/glows to match the new yellow accent and keep ring/border/foreground mappings intact)."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add the provided Baidees Salon logo assets and wire them into Navbar, Footer, favicon, and social/OG metadata for sharp rendering across devices.",
      "acceptanceCriteria": [
        "Navbar brand area displays the provided logo (with appropriate sizing) and links to the Home route.",
        "Footer brand area includes the provided logo (with appropriate sizing) without breaking the existing layout.",
        "`frontend/index.html` includes favicon link(s) pointing to the new logo-derived favicon asset(s).",
        "Logo assets are loaded from frontend static assets (not from the backend) and render sharply on common device pixel ratios."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/baidees-logo.dim_1024x1024.png",
          "operation": "create",
          "description": "Add the generated square transparent logo asset at frontend/public/assets/generated/baidees-logo.dim_1024x1024.png for reuse across brand placements."
        },
        {
          "path": "frontend/public/assets/generated/baidees-logo-horizontal.dim_1600x600.png",
          "operation": "create",
          "description": "Add the generated horizontal transparent logo asset at frontend/public/assets/generated/baidees-logo-horizontal.dim_1600x600.png for header/footer brand usage."
        },
        {
          "path": "frontend/public/assets/generated/favicon.dim_32x32.png",
          "operation": "create",
          "description": "Add the generated favicon asset at frontend/public/assets/generated/favicon.dim_32x32.png for browser tab/favicon usage."
        },
        {
          "path": "frontend/public/assets/generated/apple-touch-icon.dim_180x180.png",
          "operation": "create",
          "description": "Add the generated Apple touch icon at frontend/public/assets/generated/apple-touch-icon.dim_180x180.png for iOS home screen usage."
        },
        {
          "path": "frontend/public/assets/generated/og-image.dim_1200x630.png",
          "operation": "create",
          "description": "Add the generated Open Graph preview image at frontend/public/assets/generated/og-image.dim_1200x630.png for social sharing previews."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Wire static metadata to the new assets: add/replace favicon and apple-touch-icon link tags referencing frontend/public/assets/generated/favicon.dim_32x32.png and frontend/public/assets/generated/apple-touch-icon.dim_180x180.png, and add/replace OG image meta tags (and any existing social preview image wiring) referencing frontend/public/assets/generated/og-image.dim_1200x630.png."
        },
        {
          "path": "frontend/src/components/branding/BrandLogo.tsx",
          "operation": "create",
          "description": "Create a small reusable BrandLogo component that renders the provided logo assets from frontend static files with responsive sizing (mobile/desktop) and preserves clean luxury spacing; use horizontal logo where appropriate and fall back to square when needed."
        },
        {
          "path": "frontend/src/components/layout/Navbar.tsx",
          "operation": "modify",
          "description": "Replace the text-based brand in the Navbar with the new BrandLogo component in the brand area, ensuring it links to the Home route and scales appropriately for mobile and desktop without pixelation."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Integrate the BrandLogo component into the Footer brand area (replacing or pairing with existing text as needed) while preserving layout, spacing, and readability across breakpoints."
        }
      ]
    }
  ]
}